src/InformationRegisters/рнсОбщиеНастройки/рнсОбщиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рнсОбщиеНастройки</name>
  <resources>
    <name>Настройки</name>
    <comment>Настройки</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение1</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение2</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение3</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение4</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение5</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.рнсРазделыОбщихНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>CatalogRef.рнсКлючиОбщихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/рнсОбщиеНастройки/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	              	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("рнсРаздел", Запись.Раздел));
	
	УстановитьНастройкиКолонок();
	       		
	ПодготовитьФормуПоРазделу(); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	         	
	Если НЕ ЗначениеЗаполнено(Запись.Раздел) Тогда // по стандарту так
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ТекущийОбъект.Настройки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХранилища));	
	КонецЕсли; 		
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура РазделПриИзменении(Элемент)
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("рнсРаздел", Запись.Раздел));
	
	УстановитьНастройкиКолонок();
	
	ПодготовитьФормуПоРазделу();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьДополнительныеНастройкиНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИмяФормыДополнительныхНастроек) Тогда 
		
		ПараметрыФормы = Новый Структура;
		Для Сч = 1 По 5 Цикл
			ПараметрыФормы.Вставить("Значение" + Сч, Запись["Значение" + Сч]);	
		КонецЦикла; 		   
		
		ПараметрыФормы.Вставить("АдресХранилища", АдресХранилища);
		ПараметрыФормы.Вставить("Раздел", Запись.Раздел);
		ПараметрыФормы.Вставить("Секция", Запись.Секция);
		ПараметрыФормы.Вставить("Ключ", Запись.Ключ);
		
		ОткрытьФорму(ИмяФормыДополнительныхНастроек, ПараметрыФормы, 
						ЭтотОбъект,,,, Новый ОписаниеОповещения("ВводДополнительныхНастроек_Завершение", ЭтотОбъект));	
						
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура ВводДополнительныхНастроек_Завершение(Результат, ДополнительныеНастройки) Экспорт
	
	Если Результат = Неопределено Тогда
		
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		
		ЗаголовокНадписи = НСтр("ru = 'Дополнительные настройки не заданы'");		
		
	Иначе
		
		Если ЭтоАдресВременногоХранилища(Результат) Тогда
			Если Результат <> АдресХранилища Тогда
				ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
				АдресХранилища = Результат;	
			КонецЕсли;    			 			
		Иначе
			ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		КонецЕсли;
		
		ЗаголовокНадписи = НСтр("ru = 'Дополнительные настройки заданы'");
		
	КонецЕсли; 	
	
	Элементы.НадписьОткрытьДополнительныеНастройки.Заголовок = ЗаголовокНадписи; 
	
КонецПроцедуры   

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Процедура ПодготовитьФормуПоРазделу()
	
	Если ЗначениеЗаполнено(Запись.Раздел) Тогда
		
		ИмяФормыДополнительныхНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Раздел, "ИмяФормыЗаполненияХранилища");
		
		Если ЗначениеЗаполнено(ИмяФормыДополнительныхНастроек) Тогда
			
			Элементы.НадписьОткрытьДополнительныеНастройки.Доступность 	= Истина;
			ЗаписьОбъект 												= РеквизитФормыВЗначение("Запись");
			ЗначениеХранилища 											= ЗаписьОбъект.Настройки.Получить(); 		
			
			Если ЗначениеХранилища = Неопределено Тогда			
				Элементы.НадписьОткрытьДополнительныеНастройки.Заголовок = НСтр("ru = 'Расширенные настройки не заданы'");			
			Иначе
				Элементы.НадписьОткрытьДополнительныеНастройки.Заголовок = НСтр("ru = 'Расширенные настройки заданы'");			
			КонецЕсли;
			
			АдресХранилища = ПоместитьВоВременноеХранилище(ЗначениеХранилища, УникальныйИдентификатор);
			
		Иначе
			Элементы.НадписьОткрытьДополнительныеНастройки.Заголовок 	= НСтр("ru = 'Расширенные настройки раздела не предусмотрены'");
			Элементы.НадписьОткрытьДополнительныеНастройки.Доступность 	= Ложь;		
		КонецЕсли;
		
	КонецЕсли; 		
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьНастройкиКолонок()
	
	Если ЗначениеЗаполнено(Запись.Раздел) Тогда 		
		
		СекцияСписокВыбора = Элементы.Секция.СписокВыбора;			
		
		СекцияСписокВыбора.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРаздела.ТипЗначения1.ТипЗначения КАК Значение1,
		|	ТаблицаРаздела.ТипЗначения2.ТипЗначения КАК Значение2,
		|	ТаблицаРаздела.ТипЗначения3.ТипЗначения КАК Значение3,
		|	ТаблицаРаздела.ТипЗначения4.ТипЗначения КАК Значение4,
		|	ТаблицаРаздела.ТипЗначения5.ТипЗначения КАК Значение5,
		|	ТаблицаРаздела.ТипЗначения1.Заголовок КАК Заголовок1,
		|	ТаблицаРаздела.ТипЗначения2.Заголовок КАК Заголовок2,
		|	ТаблицаРаздела.ТипЗначения3.Заголовок КАК Заголовок3,
		|	ТаблицаРаздела.ТипЗначения4.Заголовок КАК Заголовок4,
		|	ТаблицаРаздела.ТипЗначения5.Заголовок КАК Заголовок5
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек КАК ТаблицаРаздела
		|ГДЕ
		|	ТаблицаРаздела.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Секция КАК Секция
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек.Секции КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка
		|	И Таблица.Ссылка.ИспользоватьСекцииРаздела";
		
		Запрос.УстановитьПараметр("Ссылка", Запись.Раздел);
		
		РезультатЗапроса 		= Запрос.ВыполнитьПакет();		
		ВыборкаТипыЗначений 	= РезультатЗапроса[0].Выбрать(); 
		ВыборкаСекции 			= РезультатЗапроса[1].Выбрать();		
		
		Если ВыборкаТипыЗначений.Следующий() Тогда
			Для НомерПоПорядку = 1 По 5 Цикл 			
				
				Имя			= "Значение" + НомерПоПорядку; 
				Заголовок 	= ВыборкаТипыЗначений["Заголовок" + НомерПоПорядку];
				ПолеВвода 	= Элементы[Имя];
				
				Если ЗначениеЗаполнено(ВыборкаТипыЗначений[Имя]) Тогда
					ПолеВвода.ОграничениеТипа 	= ВыборкаТипыЗначений[Имя];  
					ПолеВвода.Видимость 		= Истина;
					ПолеВвода.Заголовок 		= ?(ЗначениеЗаполнено(Заголовок), Заголовок, Имя);
				Иначе
					ПолеВвода.Видимость 		= Ложь;	
				КонецЕсли;   			
				
			КонецЦикла;  					
		КонецЕсли;	 
		
		Если ВыборкаСекции.Количество() = 0 Тогда 
			Элементы.Секция.Видимость = Ложь;	
		Иначе   
			
			Элементы.Секция.Видимость = Истина;
			
			Пока ВыборкаСекции.Следующий() Цикл
				СекцияСписокВыбора.Добавить(ВыборкаСекции.Секция);		  					
			КонецЦикла;	  
			
		КонецЕсли; 		    	
		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти
